#### InstanceNode Members

---

|  |
| --- |
| InstanceNode Class   Methods   Properties   See Also |

The  InstanceNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RenderNode  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetSymbolGeometryId | Gets the SymbolGeometryId associated with the node. |
| Public method | GetSymbolId | **Obsolete.**   The Id of the symbol associated with the node. This property is deprecated in Revit 2023 and may be removed in a future version of Revit. For an InstanceNode please use the GetSymbolGeometryId().SymbolId. For a LinkNode please use SymbolId property. In Revit 2023 we introduced instance nodes that point to a part of the symbol's geometry. For comparing if two such nodes point to the same geometry, the SymbolId isn't enough. SymbolGeometryId can be used to identify a piece of geometry managed by a symbol element. (Inherited from  GroupNode  .) |
| Public method | GetTransform | A transformation matrix associated with the node. (Inherited from  GroupNode  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RenderNode  .) |
| Public property | NodeName | A readable name of the output node. (Inherited from  RenderNode  .) |

# See Also

InstanceNode Class

Autodesk.Revit.DB Namespace